examples_prescribed_oscillation/3D_RM6_oscil_surge/T8.75/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(inlet|outlet)"
    {
        type            zeroGradient;
    }

    atmosphere
    {
        type            calculated;
        value           $internalField;
    }

    bottom
    {
        type            slip;
        //type            nutkWallFunction;
        //value           $internalField;
    }

    "(baffle.*)"
    {
        type            cyclic;
    }

    "(object.*)"
    {
        type            nutkWallFunction;
        value           $internalField;
    }

}


// ************************************************************************* //
