examples_prescribed_oscillation/3D_RM6_oscil_surge/T8.75/constant/waveInput.txt
waveHeights
1
...
wavePeriods
1
...
wavePhases
1
...
waveAngles
1
...
waveDirs
1
...
